# 6. Напишите программу, которая сгенирирует 2 кортежа, состоящих из
# нечетного рандомного кол-ва элементов от 3 до 99 каждый,
# все числа также генирируются рандомно от 0 до 1000 и не повторяются
# двыжды в одном и том же кортеже.
# Переменные для кортежей назвать "tuple1" и "tuple2".
#
# Выведите на экран сообщение с указанием того, в каком кортеже
# сумма его элементов оказалась больше, чем у другого.
#
# Вывести на экран индексы минимальных и максимальных элементов
# этих кортежей.
#
# Вывести на экран среднее из чисел кождого кортежа, а также его индекс.