# 1. Вводится 2 числа с клавиатуры (от 1 до 20).
# Так же генерируется 2 числа рандомно (от 1 до 20).
# Посчитать, сколько раз пара введенных чисел с клавиатуры
# окажется больше рандомной пары. Проверку выполнить 7 раз.
# В случае если кол-во раз, когда введеные с клавиатуры числа,
# оказались больше сгенирированных, будет больше кол-во раз, когда
# сгенированные числа оказались больше введеных, нужно вывести
# случайные числа, полученные в 4 итерации, если же наоброт, то
# вывести общую сумму всех сгенированных за 7 итераций.



# 2. Напишите программу, которая генирирует случайное число
# от -1.000.000.000 до +1.000.000.000 и выводит на экран сколько раз
# в нем встречается та или иная цифра(цифра – это от 0 до 9),
# из которого оно состоит.



# Например если генируруется число 111333, то на экран должно вывести
# 'Число "111333" состоит из следущих цифр: 1, 3'
# 'Цифра "1" встречается 1 раз(-а)'
# 'Цифра "3" встречается 3 раз(-а)'
# Сколько будет уникальных цифр, столько должно быть и выводов на экран.



# 3. Посчитать, сколько раз встречается определенная цифра
# в списке чисел. (Цифра – это от 0 до 9)
# Количество введенных чисел в список и искомая цифра задаются
# с клавиатуры. Числа для списка выбираются рандомно.



# 4. Посчитать, сколько пар букв верхнего и нижнего регистра
# находится в веденном с клавиатуры слове.
# (Например: HjkLM - 1 пара нижнего(это jk), 1 пара верхнего(это LM))
# а также отдельно вывести на экран сколько всего букв в слове,
# отдельно сколько гласных и согласных.




# 5. Дан список:
# ['Я',1,'лeчу',6,'Привет','крутой','Привет',6,1,'программист','лечу',"!"]
# Выведите только те элементы, которые встречаются в списке один раз.
# Элементы нужно выводить в том порядке, в котором они встречаются.
# Вывод нужно сделать в одну строку.



# 6. Напишите программу, которая сгенирирует 2 кортежа, состоящих из
# нечетного рандомного кол-ва элементов от 3 до 99 каждый,
# все числа также генирируются рандомно от 0 до 1000 и не повторяются
# двыжды в одном и том же кортеже.
# Переменные для кортежей назвать "tuple1" и "tuple2".
#
# Выведите на экран сообщение с указанием того, в каком кортеже
# сумма его элементов оказалась больше, чем у другого.
#
# Вывести на экран индексы минимальных и максимальных элементов
# этих кортежей.
#
# Вывести на экран среднее из чисел кождого кортежа, а также его индекс.