# Создайте кортеж из случайных 10 чисел.
# Найдите индексы максимального и
# минимального элемента

# a = (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
# print(a.index(max(a)))
# print(a.index(min(a)))

# Создайте словарь person, в котором будут
# присутствовать ключи name, age, city.
# Выведите значение возраста из словаря
# person
person = dict.fromkeys(['name', 'age', 'city'])
person['age'] = 20
print(person['age'])

# dict.values(['name'])

