# Вывести на экран символ с кодом 104
# Вывести на экран код символа "G"

print(chr(104))
print(ord('G'))