# 4 Дана строка str = "Я крутой программист"
# 4.1 Вывести на экран только последний символ строки.
# 4.2 Вывести на экран только срез этой строки "Я крутой".
# 4.3 Вывести только чётные символы этой строки.
# 4.4 Вывести на экран каждый третий символ строки в обратном порядке, вывод должен начинаться с символа "т".
# 4.5 Вывести на экран длину данной строки
# 4.6 Пересобрать строку str в список, используя пробел в качестве разделителя элементов будущего списка.
# 4.7 Вести на экран длину/кол-во элементов получившегося списка из пункта 5.6.
# 4.8 Получившийся список из пункта 5.6 обратно пересобрать в строку используя запятую в качестве разделителя.
# 4.9 Вывести на экран кол-во сколько раз символ "р" встречается в этой строке.