# 6. Напишите программу, которая определяет,
# является ли введенное число четным или нечетным.

num = int(input('Введите число: '))
# if num % 2:
#     print('Число нечетное')
# else:
#     print('Число четное')


print('Число нечетное') if num % 2 else print('Число четное')
