# 2. Напишите программу, которая принимает целое число x
# и определяет, принадлежит ли данное число указанным промежуткам:
# (-∞, -3] или [7, +∞).
#
num2 = int(input('Введите целое число: '))
if num2 >= -3 and num1 <= 17:
    print('Введенное число принадлежит промежутку (-1; 17)')
else:
    print('Введенное число не принадлежит промежутку (-1; 17)')
